app/controllers/users_controller.rb

  def create
    logout_keeping_session!
    @user = User.new(params[:user])
    success = @user && @user.save
---
INSERT INTO `users` (`name`, `salt`, `updated_at`, `activated_at`, `crypted_password`, `remember_token_expires_at`, `activation_code`, `remember_token`, `login`, `email`, `created_at`) VALUES('', '4aa7d2b2a8bceaf1e8b3d7dacdca8e8c8b8821e2', '2008-10-15 18:32:47', NULL, '51a811865cf50f5ca0f7a339caecde2864ec1731', NULL, '4b4b60d400f748d0993fd6f18bb08d4e8979b388', NULL, 'quire', 'quire@example.com', '2008-10-15 18:32:47')